"""
таблица умножения вроде этой:
  1  |  2  |  3  |  4  |  5  
-----------------------------
  2  |  4  |  6  |  8  | 10  
-----------------------------
  3  |  6  |  9  | 12  | 15  
-----------------------------
  4  |  8  | 12  | 16  | 20  
-----------------------------
  5  | 10  | 15  | 20  | 25  
"""

n = int(input())
width = int(input())
for row in range(n):
    for col in range(n):
        print(f"{(row + 1) * (col + 1): ^{width}}", end=("|" if col != n - 1 else ""))
    print("\n" + "-" * ((width + 1) * n - 1) if row != n - 1 else "")